/**

   1. Вывести на экран слово “JAVA” , в строку, чтобы оно повторилось 10 раз, используя
        цикл while .
        Вывод в консоль должен быть таким:
        JAVA JAVA JAVA JAVA JAVA JAVA JAVA JAVA JAVA JAVA

   2. Повторить задание 1, но используя цикл for .
*/


package Day1;

public class Task2 {
    public static void main(String[] args) {
        for(int i = 0; i<10; i++){
            System.out.print("JAVA ");

        }

    }
}
